<?php

// Heading
$_['text_title']		 = 'پرداخت آنلاین زیبال';

// Text
$_['text_wait']  		 	= 'لطفا صبر نمایید!';
$_['text_connect'] 		 	= 'در حال اتصال به درگاه زیبال!';
$_['text_results']  	 	= 'رسید زیبال : ';
$_['text_order_no']  	 	= 'خرید شماره: ';

$_['button_view_cart']	 	= 'مشاهده سبد خرید';
$_['button_confirm']    	= 'تکمیل پرداخت';
$_['button_continue']    	= 'ادامه';


$_['error_order_id']	 	= 'شماره سفارش پیدا نشد !';

$_['error_verify'] 		 	= 'اعتبارسنجی تراکنش ناموفق بود';
$_['error_cant_connect']	= 'مشکلی در اتصال به درگاه زیبال پیش آمده است!<br>' .
	'لطفا مجددا امتحان کنید.<br>' .
	'در صورت رفع نشدن مشکل به پشتیبانی زیبال اطلاع دهید.';
$_['error_connect_verify'] 	= 'مشکلی در اعتبارسنجی پرداخت پیش آمد!<br>' .
	'لطفا مجددا امتحان کنید.<br>' .
	'در صورت رفع نشدن مشکل به پشتیبانی زیبال اطلاع دهید.';
$_['error_status_-102'] 		= "merchant یافت نشد";
$_['error_status_-103'] 		= "merchant غیرفعال";
$_['error_status_-104'] 		= "merchant نامعتبر";
$_['error_status_-201'] 		= "قبلا تایید شده";
$_['error_status_-105'] 		= "amount بایستی بزرگتر از 1,000 ریال باشد";
$_['error_status_-106'] 		= "callbackUrl نامعتبر می‌باشد. (شروع با http و یا https)";
$_['error_status_-113'] 		= "amount مبلغ تراکنش از سقف میزان تراکنش بیشتر است";
$_['error_status_-202'] 		= "سفارش پرداخت نشده یا ناموفق بوده است";
$_['error_status_-203'] 		= "رقم تراکنش با رقم پرداخت مطابقت ندارد";
$_['error_status_undefined'] = "خطای نامشخص";
